tsung/tsung_client_appts_manage.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="ashVert1.eba-8zhfquyf.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="40" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="80" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="160" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <!-- available client ports to run concurrent connections -->
    <!-- <option name="ports_range" min="1025" max="65535"/> -->

    <!-- <option name="file_server" id="users" value="users.csv"/>
    <option name="file_server" id="services" value="services.csv"/> -->
  </options>

<!--Scenario: Log in / See and Find a Service / Book a Service / Choose Availability / Logout-->
<sessions>
    <session name="manage" probability="100" type="ts_http">
      <transaction name="client">

        <!-- create a random user_id -->
        <setdynvars sourcetype="random_number" start="1" end="10">
          <var name="user_id" />
        </setdynvars>

        <!-- start out at the root but send to login ->register -->
        <request> <http url='/' version='1.1' method='GET'></http> </request>
        <request> <http url='/login' version='1.1' method='GET'></http> </request>
        
        <!-- wait for up to 2 seconds, user is thinking about login info -->
        <thinktime value="2" random="true"></thinktime>
        <request subst="true">
          <http 
            url="/login" 
            method="POST" 
            version="1.1" 
            contents="login[username]=test_user_%%_user_id%%&amp;
                login[password]=password&amp;
                commit=Log in" 
            content_type="application/x-www-form-urlencoded" />
        </request>
        
        <!-- get random appointment -->
        <setdynvars sourcetype="random_number" start="1" end="3900000">
          <var name="appt_id" />
        </setdynvars>

        <!-- book the appointment via query param -->
        <request subst="true">
          <http url='/services/1/appointments/%%_appt_id%%?do_action=book'
            version='1.1' 
            method='PATCH'
            contents = "session[:user_id]=%%_user_id%%&amp;
                commit=Book+appointment?" 
            content_type="application/x-www-form-urlencoded" >
          </http>  
        </request>

        <request> 
          <http url='/appointments' version='1.1' method='GET'></http>  
        </request>

        <!-- wait for up to 2 seconds, user is looking at their appointments -->
        <thinktime value="2" random="true"></thinktime>
        <request subst="true"> 
          <http url='/services/1/appointments/%%_appt_id%%/?do_action=cancel' 
            version='1.1' 
            method='PATCH'
            contents = "session[:user_id]=%%_user_id%%"
            content_type="application/x-www-form-urlencoded">
          </http>  
        </request>

        <request> 
          <http url='/appointments' version='1.1' method='GET'></http>  
        </request>
        
        <!-- Log out -->
        <request>
          <http 
            url="/logout" 
            method="POST" 
            version="1.1" 
            contents="_method=delete" 
            content_type="application/x-www-form-urlencoded" />
        </request>

      </transaction>
    </session>
  </sessions>
</tsung>